Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.#ctor(System.Boolean,Autodesk.Revit.DB.Color)
Creates a new instance.
shouldApply:
True if the settings should be applied, False if they should be set but not applied.
lineColor:
The desired line color, which must be a valid color.  Note that the fill
color is calculated automatically from the line color so it is not advisable
to use white, black, or shades of grey.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The lineColor argument does not represent a valid color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012